tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf8525_tdd.h
#define LG4                           522
#define LATH                          523
#define LH0                           524
#define LATH0                         525
#define LH1                           526
#define LATH1                         527
#define LH2                           528
#define LATH2                         529
#define LH3                           530
#define LATH3                         531
#define LH4                           532
#define LATH4                         533
#define LH5                           534
#define LATH5                         535
#define LH6                           536
#define LATH6                         537
#define LH7                           538
#define LATH7                         539
#define LATJ                          540
#define LATJ0                         541
#define LJ0                           542
#define LATJ1                         543
#define LJ1                           544
#define LATJ2                         545
#define LJ2                           546
#define LATJ3                         547
#define LJ3                           548
#define LATJ4                         549
#define LJ4                           550
#define LATJ5                         551
#define LJ5                           552
#define LATJ6                         553
#define LJ6                           554
#define LATJ7                         555
#define LJ7                           556
#define TRISA                         557
#define TRISA_RA0                     558
#define TRISA0                        559
#define TRISA_RA1                     560
#define TRISA1                        561
#define TRISA2                        562
#define TRISA_RA2                     563
#define TRISA_RA3                     564
#define TRISA3                        565
#define TRISA_RA4                     566
#define TRISA4                        567
#define TRISA_RA5                     568
#define TRISA5                        569
#define TRISA_RA6                     570
#define TRISA6                        571
#define TRISB                         572
#define TRISB_RB0                     573
#define TRISB0                        574
#define TRISB_RB1                     575
#define TRISB1                        576
#define TRISB_RB2                     577
#define TRISB2                        578
#define TRISB_RB3                     579
#define TRISB3                        580
#define RB4                           581
#define TRISB4                        582
#define TRISB_RB5                     583
#define TRISB5                        584
#define TRISB_RB6                     585
#define TRISB6                        586
#define TRISB_RB7                     587
#define TRISB7                        588
#define TRISC                         589
#define TRISC0                        590
#define TRISC_RC0                     591
#define TRISC1                        592
#define TRISC_RC1                     593
#define TRISC2                        594
#define TRISC_RC2                     595
#define TRISC3                        596
#define TRISC_RC3                     597
#define TRISC4                        598
#define TRISC_RC4                     599
#define TRISC5                        600
#define TRISC_RC5                     601
#define TRISC6                        602
#define TRISC_RC6                     603
#define TRISC7                        604
#define TRISC_RC7                     605
#define TRISD                         606
#define TRISD_RD0                     607
#define TRISD0                        608
#define TRISD_RD1                     609
#define TRISD1                        610
#define TRISD_RD2                     611
#define TRISD2                        612
#define TRISD_RD3                     613
#define TRISD3                        614
#define TRISD_RD4                     615
#define TRISD4                        616
#define TRISD_RD5                     617
#define TRISD5                        618
#define TRISD_RD6                     619
#define TRISD6                        620
#define TRISD_RD7                     621
#define TRISD7                        622
#define TRISE                         623
#define TRISE_RE0                     624
#define TRISE0                        625
#define TRISE1                        626
#define TRISE_RE1                     627
#define TRISE2                        628
#define TRISE_RE2                     629
#define TRISE_RE3                     630
#define TRISE3                        631
#define TRISE_RE4                     632
#define TRISE4                        633
#define TRISE_RE5                     634
#define TRISE5                        635
#define TRISE_RE6                     636
#define TRISE6                        637
#define TRISE_RE7                     638
#define TRISE7                        639
#define TRISF                         640
#define TRISF0                        641
#define TRISF_RF0                     642
#define TRISF_RF1                     643
#define TRISF1                        644
#define TRISF_RF2                     645
#define TRISF2                        646
#define TRISF3                        647
#define TRISF_RF3                     648
#define TRISF_RF4                     649
#define TRISF4                        650
#define TRISF_RF5                     651
#define TRISF5                        652
#define TRISF_RF6                     653
#define TRISF6                        654
#define TRISF7                        655
#define TRISF_RF7                     656
#define TRISG                         657
#define TRISG0                        658
#define TRISG_RG0                     659
#define TRISG1                        660
#define TRISG_RG1                     661
#define TRISG2                        662
#define TRISG_RG2                     663
#define TRISG_RG3                     664
#define TRISG3                        665
#define TRISG4                        666
#define TRISG_RG4                     667
#define TRISH                         668
#define TRISH_RH0                     669
#define TRISH0                        670
#define TRISH_RH1                     671
#define TRISH1                        672
#define TRISH_RH2                     673
#define TRISH2                        674
#define TRISH_RH3                     675
#define TRISH3                        676
#define TRISH_RH4                     677
#define TRISH4                        678
#define TRISH_RH5                     679
#define TRISH5                        680
#define TRISH_RH6                     681
#define TRISH6                        682
#define TRISH_RH7                     683
#define TRISH7                        684
#define TRISJ                         685
#define TRISJ_RJ0                     686
#define TRISJ0                        687
#define TRISJ_RJ1                     688
#define TRISJ1                        689
#define TRISJ_RJ2                     690
#define TRISJ2                        691
#define TRISJ_RJ3                     692
#define TRISJ3                        693
#define TRISJ_RJ4                     694
#define TRISJ4                        695
#define TRISJ_RJ5                     696
#define TRISJ5                        697
#define TRISJ_RJ6                     698
#define TRISJ6                        699
#define TRISJ_RJ7                     700
#define TRISJ7                        701
#define MEMCON                        702
#define WM                            703
#define WM0                           704
#define WM1                           705
#define WAIT0                         706
#define WAIT                          707
#define WAIT1                         708
#define EBDIS                         709
#define PIE1                          710
#define TMR1IE                        711
#define TMR2IE                        712
#define CCP1IE                        713
#define SSPIE                         714
#define TXIE                          715
#define TX1IE                         716
#define RCIE                          717
#define RC1IE                         718
#define ADIE                          719
#define PSPIE                         720
#define PIR1                          721
#define TMR1IF                        722
#define TMR2IF                        723
#define CCP1IF                        724
#define SSPIF                         725
#define TXIF                          726
#define TX1IF                         727
#define RCIF                          728
#define RC1IF                         729
#define ADIF                          730
#define PSPIF                         731
#define IPR1                          732
#define TMR1IP                        733
#define TMR2IP                        734
#define CCP1IP                        735
#define SSPIP                         736
#define TX1IP                         737
#define TXIP                          738
#define RC1IP                         739
#define RCIP                          740
#define ADIP                          741
#define PSPIP                         742
#define PIE2                          743
#define CCP2IE                        744
#define TMR3IE                        745
#define LVDIE                         746
#define BCLIE                         747
#define EEIE                          748
#define CMIE                          749
#define PIR2                          750
#define CCP2IF                        751
#define TMR3IF                        752
#define LVDIF                         753
#define BCLIF                         754
#define EEIF                          755
#define CMIF                          756
#define IPR2                          757
#define CCP2IP                        758
#define TMR3IP                        759
#define LVDIP                         760
#define BCLIP                         761
#define EEIP                          762
#define CMIP                          763
#define PIE3                          764
#define CCP3IE                        765
#define RXB0IE                        766
#define RXBNIE                        767
#define RXB1IE                        768
#define CCP4IE                        769
#define TXB0IE                        770
#define CCP5IE                        771
#define TMR4IE                        772
#define TXB1IE                        773
#define TXB2IE                        774
#define TXBNIE                        775
#define TX2IE                         776
#define RC2IE                         777
#define PIR3                          778
#define CCP3IF                        779
#define RXBNIF                        780
#define CCP4IF                        781
#define CCP5IF                        782
#define TMR4IF                        783
#define TXBNIF                        784
#define TX2IF                         785
#define RC2IF                         786
#define IPR3                          787
#define CCP3IP                        788
#define CCP4IP                        789
#define RXBNIP                        790
#define CCP5IP                        791
#define TMR4IP                        792
#define TX2IP                         793
#define TXBNIP                        794
#define RC2IP                         795
#define EECON1                        796
#define EECON1_RD                     797
#define EECON1_WR                     798
#define WREN                          799
#define WRERR                         800
#define FREE                          801
#define CFGS                          802
#define EEFS                          803
#define EEPGD                         804
#define RCSTA1                        805
#define RCSTA1_RX9D                   806
#define RX9D1                         807
#define RCD8                          808
#define RCSTA1_OERR                   809
#define OERR1                         810
#define RCSTA1_FERR                   811
#define FERR1                         812
#define RCSTA1_ADDEN                  813
#define RCSTA1_ADEN                   814
#define ADDEN1                        815
#define RCSTA1_CREN                   816
#define CREN1                         817
#define SRENA                         818
#define SREN1                         819
#define RCSTA1_SREN                   820
#define RC8_9                         821
#define RCSTA1_RX9                    822
#define RC9                           823
#define RX91                          824
#define RCSTA1_SPEN                   825
#define SPEN1                         826
#define TXSTA1                        827
#define TX9D1                         828
#define TXSTA1_TX9D                   829
#define TXD8                          830
#define TRMT1                         831
#define TXSTA1_TRMT                   832
#define BRGH1                         833
#define TXSTA1_BRGH                   834
#define TXSTA1_SENDB                  835
#define SENDB1                        836
#define TXSTA1_SYNC                   837
#define SYNC1                         838
#define TXEN1                         839
#define TXSTA1_TXEN                   840
#define TX91                          841
#define TX8_9                         842
#define TXSTA1_TX9                    843
#define TXSTA1_CSRC                   844
#define CSRC1                         845
#define PSPCON                        846
#define PSPMODE                       847
#define IBOV                          848
#define OBF                           849
#define IBF                           850
#define T3CON                         851
#define TMR3ON                        852
#define TMR3CS                        853
#define nT3SYNC                       854
#define T3NSYNC                       855
#define NOT_T3SYNC                    856
#define T3SYNC                        857
#define SOSCEN3                       858
#define T3CCP1                        859
#define T3CKPS                        860
#define T3CKPS0                       861
#define T3CKPS1                       862
#define T3CCP2                        863
#define T3CON_RD16                    864
#define RD163                         865
#define T3RD16                        866
#define CMCON                         867
#define CM                            868
#define CMEN0                         869
#define CM0                           870
#define CMEN1                         871
#define CM1                           872
#define CMEN2                         873
#define CM2                           874
#define CIS                           875
#define C1INV                         876
#define C2INV                         877
#define C1OUT                         878
#define C2OUT                         879
#define CVRCON                        880
#define CVR                           881
#define CVR0                          882
#define CVR1                          883
#define CVR2                          884
#define CVR3                          885
#define CVRSS                         886
#define CVREF                         887
#define CVRR                          888
#define CVROEN                        889
#define CVROE                         890
#define CVREN                         891
#define ECCP1AS_PSSBD0                892
#define PSS1BD0                       893
#define PSS1BD                        894
#define ECCP1AS_PSSBD1                895
#define PSS1BD1                       896
#define PSS1AC                        897
#define PSS1AC0                       898
#define ECCP1AS_PSSAC0                899
#define PSS1AC1                       900
#define ECCP1AS_PSSAC1                901
#define ECCP1AS                       902
#define ECCP1AS0                      903
#define ECCP1AS1                      904
#define ECCP1AS2                      905
#define ECCP1ASE                      906
#define CCP3CON                       907
#define CCP3M                         908
#define CCP3M0                        909
#define CCP3M1                        910
#define CCP3M2                        911
#define CCP3M3                        912
#define CCP3Y                         913
#define DC3B                          914
#define DC3B0                         915
#define DC3B1                         916
#define CCP3X                         917
#define P3M                           918
#define P3M0                          919
#define P3M1                          920
#define CCP2CON                       921
#define CCP2M                         922
#define CCP2M0                        923
#define CCP2M1                        924
#define CCP2M2                        925
#define CCP2M3                        926
#define DC2B                          927
#define DC2B0                         928
#define CCP2Y                         929
#define DC2B1                         930
#define CCP2X                         931
#define P2M                           932
#define P2M0                          933
#define P2M1                          934
#define CCP1CON                       935
#define CCP1M0                        936
#define CCP1M                         937
#define CCP1M1                        938
#define CCP1M2                        939
#define CCP1M3                        940
#define CCP1Y                         941
#define DC1B                          942
#define DC1B0                         943
#define CCP1X                         944
#define DC1B1                         945
#define P1M                           946
#define P1M0                          947
#define P1M1                          948
#define ADCON2                        949
#define ADCS0                         950
#define ADCS                          951
#define ADCS1                         952
#define ADCS2                         953
#define ACQT0                         954
#define ACQT                          955
#define ACQT1                         956
#define ACQT2                         957
#define ADFM                          958
#define ADCON1                        959
#define PCFG0                         960
#define PCFG                          961
#define PCFG1                         962
#define PCFG2                         963
#define CHSN3                         964
#define PCFG3                         965
#define VCFG                          966
#define VCFG0                         967
#define VCFG01                        968
#define VCFG11                        969
#define VCFG1                         970
#define ADCON0                        971
#define ADON                          972
#define nDONE                         973
#define GO_nDONE                      974
#define NOT_DONE                      975
#define GODONE                        976
#define GO_DONE                       977
#define DONE                          978
#define GO_NOT_DONE                   979
#define GO                            980
#define CHS0                          981
#define CHS                           982
#define CHS1                          983
#define CHS2                          984
#define CHS3                          985
#define SSPCON2                       986
#define SEN                           987
#define RSEN                          988
#define PEN                           989
#define RCEN                          990
#define ACKEN                         991
#define ACKDT                         992
#define ACKSTAT                       993
#define GCEN                          994
#define SSPCON1                       995
#define SSPM0                         996
#define SSPM                          997
#define SSPM1                         998
#define SSPM2                         999
#define SSPM3                         1000
#define CKP                           1001
#define SSPEN                         1002
#define SSPOV                         1003
#define WCOL                          1004
#define SSPSTAT                       1005
#define BF                            1006
#define UA                            1007
#define R_NOT_W                       1008
#define READ_WRITE                    1009
#define NOT_W                         1010
#define R_W                           1011
#define nW                            1012
#define RW                            1013
#define nWRITE                        1014
#define R                             1015
#define NOT_WRITE                     1016
#define R_nW                          1017
#define I2C_READ                      1018
#define START                         1019
#define S                             1020
#define I2C_START                     1021
#define STOP                          1022
#define I2C_STOP                      1023
#define P                             1024
#define NOT_A                         1025
#define DATA_ADDRESS                  1026
#define nA                            1027
#define D_A                           1028
#define D_nA                          1029
#define D                             1030
#define DA                            1031
#define D_NOT_A                       1032
#define NOT_ADDRESS                   1033
#define nADDRESS                      1034
#define I2C_DAT                       1035
#define CKE                           1036
#define SMP                           1037
#define T2CON                         1038
#define T2CKPS0                       1039
#define T2CKPS                        1040
#define T2CKPS1                       1041
#define TMR2ON                        1042
#define T2OUTPS0                      1043
#define TOUTPS                        1044
#define T2OUTPS1                      1045
#define T2OUTPS2                      1046
#define T2OUTPS3                      1047
#define T1CON                         1048
#define TMR1ON                        1049
#define TMR1CS                        1050
#define NOT_T1SYNC                    1051
#define T1SYNC                        1052
#define nT1SYNC                       1053
#define T1INSYNC                      1054
#define T1OSCEN                       1055
#define SOSCEN                        1056
#define T1CKPS0                       1057
#define T1CKPS                        1058
#define T1CKPS1                       1059
#define T1RD16                        1060
#define T1CON_RD16                    1061
#define RCON                          1062
#define BOR                           1063
#define NOT_BOR                       1064
#define nBOR                          1065
#define POR                           1066
#define nPOR                          1067
#define NOT_POR                       1068
#define nPD                           1069
#define NOT_PD                        1070
#define PD                            1071
#define NOT_TO                        1072
#define nTO                           1073
#define TO                            1074
#define nRI                           1075
#define NOT_RI                        1076
#define RI                            1077
#define nIPEN                         1078
#define IPEN                          1079
#define NOT_IPEN                      1080
#define WDTCON                        1081
#define SWDTE                         1082
#define SWDTEN                        1083
#define LVDCON                        1084
#define LVV0                          1085
#define LVDL0                         1086
#define LVDL                          1087
#define LVV1                          1088
#define LVDL1                         1089
#define LVV2                          1090
